In [16]:
import pandas as pd
import numpy as np

# 2.2.1 データフレームの概要

In [2]:
val=['a',1,0.5]
df=pd.DataFrame(val)
df

     0
0    a
1    1
2  0.5

In [3]:
val=[[1,2,3],[4,5,6]]
df=pd.DataFrame(val,index=['a','b'],columns=['c','d','e'])
df

   c  d  e
a  1  2  3
b  4  5  6

In [4]:
val=[[1,2,3],[4,5]]
df=pd.DataFrame(val)
df

   0  1    2
0  1  2  3.0
1  4  5  NaN

In [6]:
dictionary={'a':[1,2,3],'b':[4,5,6]}
df=pd.DataFrame(dictionary)
df

   a  b
0  1  4
1  2  5
2  3  6

In [7]:
age=pd.Series([10,12,9],index=['A','B','C'])
sex=pd.Series(['M','F','F'],index=['C','A','D'])
df=pd.DataFrame({'age':age,'sex':sex})
df

    age  sex
A  10.0    F
B  12.0  NaN
C   9.0    M
D   NaN    F

In [8]:
nest_dict={
    'age':{'A':10,'B':12,'C':9},
    'sex':{'C':'M','A':'F','D':'F'}
}
df=pd.DataFrame(nest_dict)
df

    age  sex
A  10.0    F
B  12.0  NaN
C   9.0    M
D   NaN    F

In [11]:
val=[[1,2],[4,5]]
df1=pd.DataFrame(val,columns=['A','B'],dtype=None)
print(df1.dtypes)

A    int64
B    int64
dtype: object

In [19]:
df2=pd.DataFrame(val,columns=['A','B'],dtype=np.float64)
print(df2.dtypes)

A    float64
B    float64
dtype: object

In [21]:
df=pd.DataFrame({
    'math':[82,93,77],
    'eng':[77,87,71],
    'chem':[69,91,89]
})
df

   math  eng  chem
0    82   77    69
1    93   87    91
2    77   71    89

In [22]:
df['math']

0    82
1    93
2    77
Name: math, dtype: int64

In [24]:
print(type(df['math']))

<class 'pandas.core.series.Series'>

In [25]:
df[['math','eng']]

   math  eng
0    82   77
1    93   87
2    77   71

In [26]:
print(type(df[['math','eng']]))

<class 'pandas.core.frame.DataFrame'>

In [27]:
df[df['math']>80]

   math  eng  chem
0    82   77    69
1    93   87    91

# 2.2.2 データフレームの基本操作

In [28]:
val = [[1,2,3],[4,5,6]]
df=pd.DataFrame(val)
print(df.index)
df

RangeIndex(start=0, stop=2, step=1)

   0  1  2
0  1  2  3
1  4  5  6

In [29]:
df.index=['a','b']
print(df.index)
df

Index(['a', 'b'], dtype='object')

   0  1  2
a  1  2  3
b  4  5  6

In [30]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [31]:
df.columns=['c','d','e']
df.columns

Index(['c', 'd', 'e'], dtype='object')

In [32]:
df.loc['a',:]

c    1
d    2
e    3
Name: a, dtype: int64

In [33]:
df.iloc[0,:]

c    1
d    2
e    3
Name: a, dtype: int64

In [34]:
df.iloc[1,2]

6

In [35]:
df.shape

(2, 3)

In [36]:
df.size

6

In [37]:
df=pd.DataFrame([[1.0,np.nan],[2.0,np.nan],[np.nan,3.0]])
print(df.shape)
print(df.size)

(3, 2)
6

In [40]:
df=pd.DataFrame([[1,2,3],[4,5,6]])
df.iloc[1,1]=100
df

   0    1  2
0  1    2  3
1  4  100  6

In [41]:
df['new1']=10
df['new2']=[5,6]
df

   0    1  2  new1  new2
0  1    2  3    10     5
1  4  100  6    10     6

In [42]:
val=[7,8,9,10,11]
idx=[0,1,2,'new1','new2']
series_add=pd.Series(val,index=idx,name='new3')
df=df.append(series_add)
df

      0    1  2  new1  new2
0     1    2  3    10     5
1     4  100  6    10     6
new3  7    8  9    10    11

In [43]:
df.drop(labels='new3',axis=0,inplace=True)
df

   0    1  2  new1  new2
0  1    2  3    10     5
1  4  100  6    10     6

In [45]:
df.drop(labels=['new1','new2'],axis=1,inplace=True)
df

   0    1  2
0  1    2  3
1  4  100  6

In [46]:
val=[[1,2,3],[4,5,6],[1,2,3],[3,5,6],[1,2,3]]
df=pd.DataFrame(val,columns=list('ABC'))
df

   A  B  C
0  1  2  3
1  4  5  6
2  1  2  3
3  3  5  6
4  1  2  3

In [47]:
df.duplicated(keep='first')

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [49]:
df[df.duplicated(keep='first')]

   A  B  C
2  1  2  3
4  1  2  3

In [51]:
df.drop_duplicates(keep='first',inplace=True)
df

   A  B  C
0  1  2  3
1  4  5  6
3  3  5  6

In [59]:
val=[[1,2,3],[4, 5, np.nan] , [1,np.nan,np.nan],[3,5,6],[7,8,9]]
df=pd.DataFrame(val,columns=list('ABC'))
print(df)
df.isna()

   A    B    C
0  1  2.0  3.0
1  4  5.0  NaN
2  1  NaN  NaN
3  3  5.0  6.0
4  7  8.0  9.0

       A      B      C
0  False  False  False
1  False  False   True
2  False   True   True
3  False  False  False
4  False  False  False

In [56]:
df.notna()

      A      B      C
0  True   True   True
1  True   True  False
2  True  False  False
3  True   True   True
4  True   True   True

In [58]:
df.dropna(axis=1)

   A
0  1
1  4
2  1
3  3
4  7

In [60]:
df.dropna(axis=0)

   A    B    C
0  1  2.0  3.0
3  3  5.0  6.0
4  7  8.0  9.0

# 完了